In [46]:
#this notebook to upload excels to database

In [2]:
import pandas as pd

In [3]:
import sqlite3

In [68]:
conn  = sqlite3.connect("db.sqlite3")

In [69]:
# uploading employee data

In [4]:
df = pd.read_excel(r"C:\Users\Abdallah.ashry\Downloads\Strcuctre sheet.xlsx")

In [5]:
df.rename(
    columns={
        "PTC ID":"ptc_id",
        "NAME":"employee_name",
        "ID NUMBER":"ID_number"
    },inplace=True
)

In [6]:
df.to_sql('website_employee', conn, index=False, if_exists='replace')

NameError: name 'conn' is not defined

In [73]:
conn.close()

In [6]:
df.head()

   ptc_id                          employee_name   ID_number
0   12041       RUKSHAN SUMITH W W ARACHCHILLAGE  2511259174
1   12048  SUYAMA PATHMAKUMARA K A MUDIYANSELAGE  2511293777
2   12056                          TRIVON CRASLY  2511295103
3   12052      DUMITH RAVINDRA H H MUDIYANSELAGE  2511295442
4   12042          MOHAMED HISHAM MOHAMED HASSAN  2511295913

In [7]:
import pandas as pd
import mysql.connector

# Assuming 'df' is your DataFrame with data
# For example, df = pd.DataFrame({'ptc_id': [12041, 12048, 12056, 12052, 12042],
#                                'employee_name': ['RUKSHAN SUMITH W W ARACHCHILLAGE', 'SUYAMA PATHMAKUMARA K A MUDIYANSELAGE', 'TRIVON CRASLY', 'DUMITH RAVINDRA H H MUDIYANSELAGE', 'MOHAMED HISHAM MOHAMED HASSAN'],
#                                'ID_number': [2511259174, 2511293777, 2511295103, 2511295442, 2511295913]})

# MySQL database connection parameters
mysql_username = 'root'
mysql_password = 'hp3416431#'
mysql_host = 'localhost'
mysql_port = 8051
mysql_database = 'mydb'

# Create a connection string
connection_string = f"mysql+mysqlconnector://{mysql_username}:{mysql_password}@{mysql_host}:{mysql_port}/{mysql_database}"

# Establish a connection
try:
    connection = mysql.connector.connect(
        user=mysql_username,
        password=mysql_password,
        host=mysql_host,
        port=mysql_port,
        database=mysql_database
    )

    if connection.is_connected():
        print("Connected to MySQL database")
        cursor = connection.cursor()

        for i, row in df.iterrows():
            query = f"""
                INSERT INTO website_employee (ptc_id, employee_name, ID_number)
                VALUES ({row['ptc_id']}, '{row['employee_name']}', {row['ID_number']});
            """
            cursor.execute(query)

        connection.commit()

except mysql.connector.Error as err:
    print(f"Error: {err}")

finally:
    # Close the connection when done
    if 'connection' in locals() and connection.is_connected():
        connection.close()
        print("Connection closed")

Connected to MySQL database
Connection closed

In [2]:
import pandas as pd
import mysql.connector

# Assuming 'df' is your DataFrame with data
# For example, df = pd.DataFrame({'ptc_id': [12041, 12048, 12056, 12052, 12042],
#                                'employee_name': ['RUKSHAN SUMITH W W ARACHCHILLAGE', 'SUYAMA PATHMAKUMARA K A MUDIYANSELAGE', 'TRIVON CRASLY', 'DUMITH RAVINDRA H H MUDIYANSELAGE', 'MOHAMED HISHAM MOHAMED HASSAN'],
#                                'ID_number': [2511259174, 2511293777, 2511295103, 2511295442, 2511295913]})

# MySQL database connection parameters
mysql_username = 'root'
mysql_password = 'hp3416431#'
mysql_host = 'localhost'
mysql_port = 8051
mysql_database = 'mydb'

# Create a connection string
connection_string = f"mysql+mysqlconnector://{mysql_username}:{mysql_password}@{mysql_host}:{mysql_port}/{mysql_database}"

# Establish a connection
try:
    connection = mysql.connector.connect(
        user=mysql_username,
        password=mysql_password,
        host=mysql_host,
        port=mysql_port,
        database=mysql_database
    )

    if connection.is_connected():
        print("Connected to MySQL database")
        cursor = connection.cursor()

        table_name = "website_violation"

        # Create and execute the DELETE query
        delete_query = f"DELETE FROM {table_name}"
        cursor.execute(delete_query)

        results = cursor.fetchall()
        print(results)

        connection.commit()

except mysql.connector.Error as err:
    print(f"Error: {err}")

finally:
    # Close the connection when done
    if 'connection' in locals() and connection.is_connected():
        connection.close()
        print("Connection closed")

Connected to MySQL database
[]
Connection closed

In [65]:
df[df['ptc_id']==10088]

     ptc_id                          employee_name   ID_number
178   10088  MUHAMMAD TOSIF ANJAM MUHAMMAD SADDEEQ  2466498579

In [1]:
## reading violation data

In [3]:
import pandas as pd

In [7]:
v_df = pd.read_excel(r"project_data\Violation form manually.xlsx")

In [8]:
v_df.head()

,رقم المخالفة,وصف حالة المخالفة,وصف حالة المخالفة.1,رقم هوية المخالف,الرقم التسلسلي,لوحة المركبة,نوع تسجيل اللوحة,المبلغ الاجمالي للمخالفة,مدينة وقوع المخالفة,مكان وقوع المخالفة,تاريخ المخالفة بالهجري,تاريخ دفع المخالفة بالهجري,تاريخ دفع المخالفة بالميلادي,وقت المخالفة,مبلغ المخالفة,تفاصيل المخالفة بالعربي,تفاصيل المخالفة بالانجليزي
0,6403617633,غير مسددة,UNPAID VIOLATION,7009243952,970433710,أ ر س 5357,نقل خاص,150,الرياض,جوال 555527863-Traffic,1445-06-06,NaN,NaN,17:06,150,تجاوز السرعة المحددة بأكثر من 10 الى 20 كم/س -...,تجاوز السرعة المحددة بأكثر من 10 الى 20 كم/س -...

In [10]:
v_df.columns

Index(['رقم المخالفة', 'وصف حالة المخالفة', 'وصف حالة المخالفة.1',
       'رقم هوية المخالف', 'الرقم التسلسلي', 'لوحة المركبة',
       'نوع تسجيل اللوحة', 'المبلغ الاجمالي للمخالفة', 'مدينة وقوع المخالفة',
       'مكان وقوع المخالفة', 'تاريخ المخالفة بالهجري',
       'تاريخ دفع المخالفة بالهجري', 'تاريخ دفع المخالفة بالميلادي',
       'وقت المخالفة', 'مبلغ المخالفة', 'تفاصيل المخالفة بالعربي',
       'تفاصيل المخالفة بالانجليزي'],
      dtype='object')

In [ ]:
class Violation(models.Model):
    violation_id = models.CharField(max_length=255, primary_key=True)
    violation_date = models.DateField()
    time = models.TimeField()
    bus_panel = models.CharField(max_length=255)
    Amount = models.DecimalField(max_digits=8, decimal_places=2)
    Violation_type = models.TextField()
    violation_type_arabic = models.TextField()
    employee = models.ForeignKey(Employee, on_delete=models.CASCADE,null=True,blank=True)
    pdf = models.ForeignKey(PDF, on_delete=models.CASCADE,null=True,blank=True)

In [9]:
import pandas as pd
import mysql.connector
df = pd.read_excel("vehicle_data.xlsx")
df.head()

   SR plate_eng    plate_ar  fleet_no vehicle_user
0   1   8541GDB  أ س م 4644     21001   East Depot
1   2   3499DRA  أ ر د 3499     21002   West Depot
2   3   3479DRA  أ ر د 3479     21003   West Depot
3   4   3475DRA  أ ر د 3475     21004   East Depot
4   5   6877BRA  أ ر ب 6877     21005   West Depot

In [17]:
import pandas as pd
import mysql.connector
df = pd.read_excel("vehicle_data.xlsx")

# MySQL database connection parameters
mysql_username = 'root'
mysql_password = 'hp3416431#'
mysql_host = 'localhost'
mysql_port = 8051
mysql_database = 'mydb'

# Create a connection string
connection_string = f"mysql+mysqlconnector://{mysql_username}:{mysql_password}@{mysql_host}:{mysql_port}/{mysql_database}"

# Establish a connection
try:
    connection = mysql.connector.connect(
        user=mysql_username,
        password=mysql_password,
        host=mysql_host,
        port=mysql_port,
        database=mysql_database
    )

    if connection.is_connected():
        print("Connected to MySQL database")
        cursor = connection.cursor()

        table_name = "website_vehicle"

        for i, row in df.iterrows():
            query = f"""
                INSERT INTO website_vehicle (fleet_no, vehicle_user, plate_eng, plate_ar, vehicle_type)
                VALUES ('{row['fleet_no']}', '{row['vehicle_user']}', '{row['plate_eng']}', '{row['plate_ar']}', 'Bus');
            """
            cursor.execute(query)

        connection.commit()



except mysql.connector.Error as err:
    print(f"Error: {err}")

finally:
    # Close the connection when done
    if 'connection' in locals() and connection.is_connected():
        connection.close()
        print("Connection closed")

Connected to MySQL database
Error: 1062 (23000): Duplicate entry '8541GDB' for key 'website_vehicle.PRIMARY'
Connection closed

In [25]:
import pandas as pd
import mysql.connector
df = pd.read_excel("vehicle_data.xlsx")

# MySQL database connection parameters
mysql_username = 'root'
mysql_password = 'hp3416431#'
mysql_host = 'localhost'
mysql_port = 8051
mysql_database = 'mydb'

# Create a connection string
connection_string = f"mysql+mysqlconnector://{mysql_username}:{mysql_password}@{mysql_host}:{mysql_port}/{mysql_database}"

# Establish a connection
try:
    connection = mysql.connector.connect(
        user=mysql_username,
        password=mysql_password,
        host=mysql_host,
        port=mysql_port,
        database=mysql_database
    )

    if connection.is_connected():
        print("Connected to MySQL database")
        cursor = connection.cursor()

        table_name = "website_vehicle"

        delete_query = f"DELETE FROM {table_name}"

        cursor.execute(delete_query)
        query = f"SELECT * FROM website_vehicle"
        cursor.excute(query)
        res = cursor.fetchall()
        print(res)


except mysql.connector.Error as err:
    print(f"Error: {err}")

finally:
    # Close the connection when done
    if 'connection' in locals() and connection.is_connected():
        connection.close()
        print("Connection closed")

Connected to MySQL database
[]
Connection closed